hospital_app/app/controllers/chats_controller.rb

SELECT "chats".* FROM "chats" WHERE "chats"."parent_chat_id" IN (1, 2, 3, 4, 5, 6)
---
  def index
    @chats = Chat.includes(:replies).where(parent_chat_id: nil)

SELECT "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @chat = Chat.find(params[:id])

SELECT "users".* FROM "users"
---
  def new
    @chat = Chat.new
    @chat.parent_chat_id = params[:parent_chat_id] if params[:parent_chat_id]
    @users = User.all

SELECT "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT 1  [["id", "5"]]
SELECT "users".* FROM "users"
---
  def edit
    @chat = Chat.find(params[:id])
    @users = User.all

INSERT INTO "chats" ("content", "created_at", "parent_chat_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "Test chat one"], ["created_at", Thu, 21 May 2015 05:23:57 UTC +00:00], ["parent_chat_id", nil], ["updated_at", Thu, 21 May 2015 05:23:57 UTC +00:00], ["user_id", 1]]
---
  def create
    @chat = Chat.new(params[:chat])

    respond_to do |format|
      if @chat.save

SELECT "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "chats" SET "user_id" = 6, "content" = 'Test Chat Six', "updated_at" = '2015-05-21 05:43:05.949634' WHERE "chats"."id" = 6
---
  def update
    @chat = Chat.find(params[:id])

    respond_to do |format|
      if @chat.update_attributes(params[:chat])