hospital_app/app/controllers/departments_controller.rb

  def show
    @department = Department.find(params[:id], include: :users)
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."department_id" IN (1)

  def create
    @department = Department.new(params[:department])

    respond_to do |format|
      if @department.save
---
INSERT INTO "departments" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 20 May 2015 22:26:27 UTC +00:00], ["name", "maternity"], ["updated_at", Wed, 20 May 2015 22:26:27 UTC +00:00]]