hospital_app/app/controllers/users_controller.rb

SELECT "chats".* FROM "chats" WHERE "chats"."user_id" IN (1)
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @user = User.find(params[:id], include: :chats)

INSERT INTO "users" ("created_at", "department_id", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 20 May 2015 22:28:32 UTC +00:00], ["department_id", 1], ["name", "purushotham"], ["updated_at", Wed, 20 May 2015 22:28:32 UTC +00:00]]
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT "departments".* FROM "departments"
---
  def set_departments
    @departments = Department.all